# Pandas 1

In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
np.array([1,2,3,4])

array([1, 2, 3, 4])

In [4]:
pd.Series([1,2,3,4],index=['A','B','C','D'])

A    1
B    2
C    3
D    4
dtype: int64

In [5]:
pd.Series([10,20,30,40],dtype='float',name="marks")

0    10.0
1    20.0
2    30.0
3    40.0
Name: marks, dtype: float64

## DataFrame

In [6]:
pd.DataFrame([[1,2,3],[4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
df = pd.DataFrame(np.arange(10,20).reshape(5,2),columns=["A","B"])

In [8]:
df

    A   B
0  10  11
1  12  13
2  14  15
3  16  17
4  18  19

In [9]:
heroes = [("batman",70),("superman",80),("spiderman",60),("ironman",100)]

In [10]:
heroes

[('batman', 70), ('superman', 80), ('spiderman', 60), ('ironman', 100)]

In [11]:
pd.DataFrame(heroes,columns=["name","power"])

        name  power
0     batman     70
1   superman     80
2  spiderman     60
3    ironman    100

In [12]:
dic = {'name':['Jitesh','Kalpesh','Kiran'],'math':[80,70,85],'science':[78,56,68]}

In [13]:
dic

{'name': ['Jitesh', 'Kalpesh', 'Kiran'],
 'math': [80, 70, 85],
 'science': [78, 56, 68]}

In [14]:
df = pd.DataFrame(dic)

In [15]:
df

      name  math  science
0   Jitesh    80       78
1  Kalpesh    70       56
2    Kiran    85       68

# Indexing and Slicing

In [16]:
df['name']

0     Jitesh
1    Kalpesh
2      Kiran
Name: name, dtype: object

In [17]:
df[['name','science']]

      name  science
0   Jitesh       78
1  Kalpesh       56
2    Kiran       68

In [18]:
df.iloc[1]

name       Kalpesh
math            70
science         56
Name: 1, dtype: object

In [19]:
df.iloc[0:2]

      name  math  science
0   Jitesh    80       78
1  Kalpesh    70       56

In [20]:
df.iloc[0:2,0:2]

      name  math
0   Jitesh    80
1  Kalpesh    70

In [21]:
df.loc[0:2,'math']

0    80
1    70
2    85
Name: math, dtype: int64

In [22]:
df.loc[0:2,['name','math']]

      name  math
0   Jitesh    80
1  Kalpesh    70
2    Kiran    85

In [23]:
df

      name  math  science
0   Jitesh    80       78
1  Kalpesh    70       56
2    Kiran    85       68

In [24]:
df['math'][0]

80

In [25]:
df.iloc[0,1]

80

In [26]:
df.loc[0,'math']

80

# Extracting data from various source

## 1. Clipboard

In [27]:
pd.read_clipboard()

Empty DataFrame
Columns: [df, =, pd.read_csv('matches.csv')]
Index: []

## 2. CSV File

In [28]:
pd.read_csv('marks.csv')

    name:marks
0    jitesh:90
1  kalpesh:100
2     kiran:90

In [29]:
pd.read_csv('marks.csv',sep=":")

      name  marks
0   jitesh     90
1  kalpesh    100
2    kiran     90

## Understanding data

In [30]:
df = pd.read_csv('matches.csv')

In [31]:
df.head()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,2017-04-06,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,2017-04-07,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,2017,Indore,2017-04-08,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,2017,Bangalore,2017-04-08,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN

In [32]:
df.head(2)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,2017-04-06,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN

In [33]:
df.tail()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
631,632,2016,Raipur,2016-05-22,Delhi Daredevils,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,6,V Kohli,Shaheed Veer Narayan Singh International Stadium,A Nand Kishore,BNJ Oxenford,NaN
632,633,2016,Bangalore,2016-05-24,Gujarat Lions,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,4,AB de Villiers,M Chinnaswamy Stadium,AK Chaudhary,HDPK Dharmasena,NaN
633,634,2016,Delhi,2016-05-25,Sunrisers Hyderabad,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Sunrisers Hyderabad,22,0,MC Henriques,Feroz Shah Kotla,M Erasmus,C Shamshuddin,NaN
634,635,2016,Delhi,2016-05-27,Gujarat Lions,Sunrisers Hyderabad,Sunrisers Hyderabad,field,normal,0,Sunrisers Hyderabad,0,4,DA Warner,Feroz Shah Kotla,M Erasmus,CK Nandan,NaN
635,636,2016,Bangalore,2016-05-29,Sunrisers Hyderabad,Royal Challengers Bangalore,Sunrisers Hyderabad,bat,normal,0,Sunrisers Hyderabad,8,0,BCJ Cutting,M Chinnaswamy Stadium,HDPK Dharmasena,BNJ Oxenford,NaN

In [34]:
df.columns

Index(['id', 'season', 'city', 'date', 'team1', 'team2', 'toss_winner',
       'toss_decision', 'result', 'dl_applied', 'winner', 'win_by_runs',
       'win_by_wickets', 'player_of_match', 'venue', 'umpire1', 'umpire2',
       'umpire3'],
      dtype='object')

In [35]:
df.shape

(636, 18)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 636 entries, 0 to 635
Data columns (total 18 columns):
id                 636 non-null int64
season             636 non-null int64
city               629 non-null object
date               636 non-null object
team1              636 non-null object
team2              636 non-null object
toss_winner        636 non-null object
toss_decision      636 non-null object
result             636 non-null object
dl_applied         636 non-null int64
winner             633 non-null object
win_by_runs        636 non-null int64
win_by_wickets     636 non-null int64
player_of_match    633 non-null object
venue              636 non-null object
umpire1            635 non-null object
umpire2            635 non-null object
umpire3            0 non-null float64
dtypes: float64(1), int64(5), object(12)
memory usage: 89.5+ KB

In [37]:
df.describe()

,id,season,dl_applied,win_by_runs,win_by_wickets,umpire3
count,636.000000,636.000000,636.000000,636.000000,636.000000,0.0
mean,318.500000,2012.490566,0.025157,13.682390,3.372642,NaN
std,183.741666,2.773026,0.156726,23.908877,3.420338,NaN
min,1.000000,2008.000000,0.000000,0.000000,0.000000,NaN
25%,159.750000,2010.000000,0.000000,0.000000,0.000000,NaN
50%,318.500000,2012.000000,0.000000,0.000000,4.000000,NaN
75%,477.250000,2015.000000,0.000000,20.000000,7.000000,NaN
max,636.000000,2017.000000,1.000000,146.000000,10.000000,NaN

In [38]:
# df.isnull()
df.isna().sum()

id                   0
season               0
city                 7
date                 0
team1                0
team2                0
toss_winner          0
toss_decision        0
result               0
dl_applied           0
winner               3
win_by_runs          0
win_by_wickets       0
player_of_match      3
venue                0
umpire1              1
umpire2              1
umpire3            636
dtype: int64

In [40]:
df['winner'].unique()

array(['Sunrisers Hyderabad', 'Rising Pune Supergiant',
       'Kolkata Knight Riders', 'Kings XI Punjab',
       'Royal Challengers Bangalore', 'Mumbai Indians',
       'Delhi Daredevils', 'Gujarat Lions', 'Chennai Super Kings',
       'Rajasthan Royals', 'Deccan Chargers', 'Pune Warriors',
       'Kochi Tuskers Kerala', nan, 'Rising Pune Supergiants'],
      dtype=object)

In [41]:
df['winner'].value_counts()

Mumbai Indians                 92
Chennai Super Kings            79
Kolkata Knight Riders          77
Royal Challengers Bangalore    73
Kings XI Punjab                70
Rajasthan Royals               63
Delhi Daredevils               62
Sunrisers Hyderabad            42
Deccan Chargers                29
Gujarat Lions                  13
Pune Warriors                  12
Rising Pune Supergiant         10
Kochi Tuskers Kerala            6
Rising Pune Supergiants         5
Name: winner, dtype: int64

In [42]:
df['player_of_match'].value_counts()

CH Gayle           18
YK Pathan          16
DA Warner          15
AB de Villiers     15
SK Raina           14
RG Sharma          14
MS Dhoni           13
G Gambhir          13
AM Rahane          12
MEK Hussey         12
V Sehwag           11
V Kohli            11
DR Smith           11
JH Kallis          10
SR Watson          10
A Mishra            9
SE Marsh            9
KA Pollard          9
SR Tendulkar        8
AT Rayudu           7
AC Gilchrist        7
RA Jadeja           7
RV Uthappa          7
A Nehra             6
BJ Hodge            6
UT Yadav            6
SP Narine           6
M Vijay             6
AD Russell          6
Harbhajan Singh     6
                   ..
AD Mathews          1
MN Samuels          1
A Singh             1
LR Shukla           1
R Ashwin            1
S Aravind           1
MS Gony             1
SM Katich           1
CRD Fernando        1
R McLaren           1
AC Voges            1
Q de Kock           1
S Sohal             1
Umar Gul            1
DL Vettori          1
JDP Oram            1
AA Jhunjhunwala     1
Shoaib Akhtar       1
JD Ryder            1
DJ Hooda            1
BCJ Cutting         1
YS Chahal           1
KK Cooper           1
KMDN Kulasekara     1
KV Sharma           1
MD Mishra           1
RS Bopara           1
GD McGrath          1
M Kartik            1
GJ Bailey           1
Name: player_of_match, Length: 201, dtype: int64